greetings = [
  "Привет, дорогой друг. Отвеn на втрои вопрос",
  "Кто вопртошает, тот получит ответ",
  "Здравстуй смертный. Сегоня для тебя овтет такой"
  ]
answers = [
  # Положительные
    "Бесспорно",
    "Предрешено",
    "Никаких сомнений",
    "Определённо да",
    "Можешь быть уверен в этом",

  # Нерешительно положительные
    "Мне кажется — «да»",
    "Вероятнее всего",
    "Хорошие перспективы",
    "Знаки говорят — «да»",
    "Да",

  # Нейтральные
    "Пока не ясно, попробуй снова",
    "Спроси позже",
    "Лучше не рассказывать",
    "Сейчас нельзя предсказать",
    "Сконцентрируйся и спроси опять)",

  # Отрицательные
    "Даже не думай",
     "Мой ответ — «нет»",
    "По моим данным - нет",
    "Перспективы не очень хорошие",
    "Весьма сомнительн"
    ]
puts greetings.sample
sleep 2
puts answers.sample
